---
kind: other
id: Methods.T:Autodesk.Revit.DB.DirectContext3D.VertexBuffer
source: html/5f250e64-47c7-1730-cc98-802c24bd73bb.htm
---
# VertexBuffer Methods

Gets a handle to the buffer's memory that has been mapped. Writing data to the buffer using the handle is an alternative to using stream objects.